app/controllers/boards_controller.rb

  def load_stories
    @states_with_stories = Story::STATES.map do |state|
---
SELECT * FROM `stories` WHERE (`stories`.`state` = 'todo')